In [49]:
import pandas as pd

In [50]:
df = pd.read_csv("../data/Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [51]:
print(f"Dimensions, (Rows, cols): {df.shape}")
print(f"Column names: {df.columns}")

# Lowering the column names:
df.columns = df.columns.str.lower()

print(f"\nColumn names after lowering: {df.columns}")

Dimensions, (Rows, cols): (891, 12)
Column names: Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Column names after lowering: Index(['passengerid', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

In [52]:
print("Datatypes:\n\n",df.dtypes)

Datatypes:

 passengerid      int64
survived         int64
pclass           int64
name            object
sex             object
age            float64
sibsp            int64
parch            int64
ticket          object
fare           float64
cabin           object
embarked        object
dtype: object

In [53]:
# Checking the unique values;
for col in df.columns:
    print(f"Column: {col}")
    print(f"Unique values count: {len(df[col].unique())}")

    if len(df[col].unique()) <= 10:
        print(f"Unique values: {df[col].unique()}")
    print()

Column: passengerid
Unique values count: 891

Column: survived
Unique values count: 2
Unique values: [0 1]

Column: pclass
Unique values count: 3
Unique values: [3 1 2]

Column: name
Unique values count: 891

Column: sex
Unique values count: 2
Unique values: ['male' 'female']

Column: age
Unique values count: 89

Column: sibsp
Unique values count: 7
Unique values: [1 0 3 4 2 5 8]

Column: parch
Unique values count: 7
Unique values: [0 1 2 5 3 4 6]

Column: ticket
Unique values count: 681

Column: fare
Unique values count: 248

Column: cabin
Unique values count: 148

Column: embarked
Unique values count: 4
Unique values: ['S' 'C' 'Q' nan]

In [54]:
# Handling the null values:
print(df.isnull().sum())

passengerid      0
survived         0
pclass           0
name             0
sex              0
age            177
sibsp            0
parch            0
ticket           0
fare             0
cabin          687
embarked         2
dtype: int64

In [55]:
# handling age:

print(df["age"].min())
print(df["age"].max())

# Filling the age missing data with Median:
df["age"] = df["age"].fillna(df["age"].median())

0.42
80.0

In [56]:
# Using Most frequent to handle embarked
df["embarked"] = df["embarked"].fillna(df["embarked"].mode()[0])

In [57]:
# Dropping the column table, as most of the data is missing
df = df.drop(columns=["cabin"])

In [58]:
print("Checking the Null values again:\n\n",df.isnull().sum())

Checking the Null values again:

 passengerid    0
survived       0
pclass         0
name           0
sex            0
age            0
sibsp          0
parch          0
ticket         0
fare           0
embarked       0
dtype: int64

In [59]:
df.head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [ ]:
# Saving the CLEANED CSV FILE

df.to_csv("../data/titanic_cleaned.csv", index=False)